from Product import (
    Product,
)
from Menu import (
    Menu,
)


class Main:
    """Класс, демонстрирующий работу конструкторов, методов и операций класса Product. """

    print("----------------------------------------------------------------------")
    print("|         Демонстрация работы конструкторов, методов и операций      |")
    print("----------------------------------------------------------------------")

    pencil = Product("pencil", "fh4378", "578")
    pen = Product()

    print("|Создано два экзмепляра: pencil - с параметрами, pen - без параметров|")
    print("----------------------------------------------------------------------")
    print("|        ", pencil.show_info(), "       | ")
    print("----------------------------------------------------------------------")
    print("|           ", pen.show_info(), "          |")
    print("----------------------------------------------------------------------")
    print("|               Изменение полей с помощью set (сеттеров)             |")
    print("----------------------------------------------------------------------")
    print("|    Изменение наименований на Карандаш у pencil и на Ручка у pen    |")
    print("----------------------------------------------------------------------")
    print("|         Посмотрим на новый вид полной информации о товарах         |")
    print("----------------------------------------------------------------------")

    pencil.set_name("карандаш")
    pen.set_name("Ручка")

    print("|       ", pencil.show_info(), "      | ")
    print("----------------------------------------------------------------------")
    print("|           ", pen.show_info(), "         |")
    print("----------------------------------------------------------------------")
    print("|      Можно получить информацию о поле с помощью get (геттера)      |")
    print("----------------------------------------------------------------------")
    print("|                   Количество товара 'ручка':", pen.get_quantity(), "                    |")
    print("----------------------------------------------------------------------")
    print("|                   Количество товара 'карандаш':", pencil.get_quantity(), "               |")
    print("----------------------------------------------------------------------")
    print("|     Можно узнать, достаточно ли какого-либо товара (в штуках)      |")
    print("----------------------------------------------------------------------")
    print("|Для этого вводится нужное количество товара. Посмотрим на примере 50|")
    print("----------------------------------------------------------------------")
    print("|            Карандаш - достаточно. Ручка - не достаточно            |")
    print("----------------------------------------------------------------------")
    print("|      Можно узнать, длинное ли то или иное наименование товара      |")
    print("----------------------------------------------------------------------")
    print("|Для этого длина наименований сравнивается с уже заданной длиной (10)|")
    print("----------------------------------------------------------------------")
    print("|               Карандаш - короткое. Ручка - короткое                |")
    print("----------------------------------------------------------------------")
    print("|                         Конец демонстрации                         |")
    print("----------------------------------------------------------------------")

    Menu(1).start()
